Tekla Open API Reference for Tekla Structures 2025
ModelHandler.Save Method
Overload List
Name | Description
Save(String, String)
 Saves current model with comment and user information.
Save(String, String, String)
 Saves current model with comment and user information.
Top
See Also
Reference
ModelHandler Class
Tekla.Structures.Model Namespace